{
  "job": "Project Plant Engineer",
  "description": "1. Project and Plant Engineer MEP f/m/d Location:  Graz, AT Company:  AVL List GmbH Job Function:  Instrumentation and Test Systems Contract Type:  Permanent Posting Date:  Dec 30, 2023 Job ID:  36007  The automotive industry is undergoing change, particularly with regard to drive technology. Battery electric and hydrogen are the areas with the strongest focus. In the area of AVL-Tech Center Solutions, we realize test bench systems up to turnkey test centers for our customers in order to enable this transformation. These consist of complex test systems, technical building equipment (TGA) including buildings.    We are looking for reinforcement in our dynamic team! Work with us on intelligent, sustainable and future-oriented solutions for test centers (Tech Center). We support our customers in the development and testing of technologically advanced complete systems (especially battery electric and hydrogen), components and in all sub-areas of mobility.   YOUR RESPONSIBILITY:   Preparation of technical concepts and active technical coordination for the overall solution in the combination of building and plant construction  Planning on concept and basis level as well as preparation of functional tenders   Direct communication with our customers, partner companies and suppliers   Active participation in sales projects together with the proposal team to develop the optimal concepts and solution based on our customer's requirements   Integration of complex systems, coordination of interfaces and assurance of the overall function   Technical conception and coordination of project participants  Partially active supervision of technical construction or construction support (willingness to travel)    YOUR PROFILE:   Completed technical education (Secondary Technical College / University of Applied Sciences / University of Technology) with focus on energy and environmental technology / HVAC / building services engineering   Several years of professional experience in planning and design of technically complex projects and integration of technically complex solutions with focus on TGA (HVAC)     Basic knowledge of structural engineering, plant engineering, pipeline construction, electrical engineering, measurement and control technology, extinguishing systems, fire alarm systems and gas warning systems  Consideration of relevant standards and laws  Ideally basic knowledge of HOAI, CAD e.g. REVIT, ACAD; BIM coordination  Talent for communication, organization and coordination   Good written and spoken German and English   Willingness to travel internationally    WE OFFER:   Homeoffice  Flexitime Regulation  Canteen  Award-winning Training Programs  Health Management  Parental Leave Management (Maternity/Paternity Protection & Educational Leave)   Annual Remuneration: Due to the Austrian Equal Treatment Act we are obligated to state the annual gross remuneration (full-time) for this position as a basis for negotiation: €52,000.00. The Employee will be classified according to the Collective Agreement for Employees of Industry (Collective Bargaining Agreement of the Automotive Industry). We will, in any case, offer market-conforming payment taking qualifications and professional experience into account.  https://jobs.avl.com/job/Graz-Project-and-Plant-Engineer-MEP-fmd/978145401/",
  "content": {
    "title": "1. Project and Plant Engineer MEP f/m/d",
    "description": "Location:  Graz, AT Company:  AVL List GmbH Job Function:  Instrumentation and Test Systems Contract Type:  Permanent Posting Date:  Dec 30, 2023 Job ID:  36007 The automotive industry is undergoing change, particularly with regard to drive technology. Battery electric and hydrogen are the areas with the strongest focus. In the area of AVL-Tech Center Solutions, we realize test bench systems up to turnkey test centers for our customers in order to enable this transformation. These consist of complex test systems, technical building equipment (TGA) including buildings. We are looking for reinforcement in our dynamic team! Work with us on intelligent, sustainable and future-oriented solutions for test centers (Tech Center). We support our customers in the development and testing of technologically advanced complete systems (especially battery electric and hydrogen), components and in all sub-areas of mobility.",
    "responsibilites": [
      "Preparation of technical concepts and active technical coordination for the overall",
      "solution in the combination of building and plant construction",
      "Planning on concept and basis level as well as preparation of functional tenders",
      "Direct communication with our customers, partner companies and suppliers",
      "Active participation in sales projects together with the proposal team to develop the",
      "optimal concepts and solution based on our customer's requirements",
      "Integration of complex systems, coordination of interfaces and assurance of the overall",
      "function",
      "Technical conception and coordination of project participants",
      "Partially active supervision of technical construction or construction support (willingness",
      "to travel)"
    ],
    "profile": [
      "Completed technical education (Secondary Technical College / University of Applied",
      "Sciences / University of Technology) with focus on energy and environmental technology",
      "/ HVAC / building services engineering",
      "Several years of professional experience in planning and design of technically complex",
      "projects and integration of technically complex solutions with focus on TGA (HVAC)",
      "Basic knowledge of structural engineering, plant engineering, pipeline construction,",
      "electrical engineering, measurement and control technology, extinguishing systems, fire",
      "alarm systems and gas warning systems",
      "Consideration of relevant standards and laws",
      "Ideally basic knowledge of HOAI, CAD e.g. REVIT, ACAD; BIM coordination",
      "Talent for communication, organization and coordination",
      "Good written and spoken German and English",
      "Willingness to travel internationally"
    ],
    "offer": [
      "Homeoffice",
      "Flexitime Regulation",
      "Canteen",
      "Award-winning Training Programs",
      "Health Management",
      "Parental Leave Management (Maternity/Paternity Protection & Educational Leave)",
      "Annual Remuneration: Due to the Austrian Equal Treatment Act we are obligated to state the",
      "annual gross remuneration (full-time) for this position as a basis for negotiation: €52,000.00.",
      "The Employee will be classified according to the Collective Agreement for Employees of",
      "Industry (Collective Bargaining Agreement of the Automotive Industry). We will, in any case,",
      "offer market-conforming payment taking qualifications and professional experience into account.",
      "https://jobs.avl.com/job/Graz-Project-and-Plant-Engineer-MEP-fmd/978145401/"
    ]
  }
}